Cases/container/container_solarLoad_coarser/system/battery_template/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 285;

    boundaryField
    {
        container
        {
            type zeroGradient;
        }
        battery0_0_to_airInside
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;            
            Tnbr            T;
            thicknessLayers (0.01);
            kappaLayers     (0.5);
            kappaMethod     directionalSolidThermo;
            alphaAni        Anialpha;
            value           $internalField;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
    }
}

// ************************************************************************* //
