Cases/container/container_solarLoad_coarser/system/ground/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


T
{
    internalField   uniform 285;

    boundaryField
    {
            // ".*"
            // {
            //     type    zeroGradient;
            //     value   $internalField;
            // }

        ground_to_airOutside
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            qrNbr           qr;
            qr              none;
            kappa           none;
            thermalInertia  true;
            value           $internalField;
        }
        ground_to_carrier
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            qrNbr           none;
            qr              none;
            kappa           none;
            // thermalInertia  true;
            value           $internalField;
        }
        bottom
        {
            type            externalWallHeatFluxTemperature;
            mode            coefficient;
            Ta              uniform 313.0;
            h               uniform 10e5;
            kappaMethod     solidThermo;
            kappa           none;
            thicknessLayers (1 2);
            kappaLayers     (100 200);
            value           uniform 300.0;
        }
        air
        {
            type        zeroGradient;
        }

            // floor_to_air
            // {
            //     type            compressible::turbulentTemperatureRadCoupledMixed;
            //     Tnbr            T;
            //     kappaMethod     solidThermo;
            //     qrNbr           qr;
            //     qr              none;
            //     kappa           none;
            //     thermalInertia  true;
            //     value           uniform 300;
            // }

            // floor_to_domain3
            // {
            //     type    zeroGradient;
            //     value   uniform 300;
            // }

            // minZ
            // {
            //     type            externalWallHeatFluxTemperature;
            //     mode            coefficient;
            //     Ta              uniform 313.0;
            //     h               uniform 10e5;
            //     kappaMethod     solidThermo;
            //     kappa           none;
            //     thicknessLayers (1 2);
            //     kappaLayers     (100 200);
            //     value           uniform 300.0;
            // }
    }
}

// ************************************************************************* //
